# Project 2:  Lucid Titanic Sleuthing

## Part 1: Developing an understanding of the data

#### Based on the description of the data you read in the readme describe in your own words this data.

This is a dataset that contains the passenger manifest of the Titanic.  The data contains demographic data on the passengers that includes columns for name, age, sex, passenger class (a proxy for socio-economic status) and whether or not the passenger was travelling alone or in a group (family) and whether or not the passenger survived.  Other data includes: point of embarkation, home destination, cabin, ticket number, fare paid and whether or not a body was recovered if the passenger did not survive.  We will examine age, sex, passenger class and group status to see how differences in these statistics accounted for differences in survival rates.

#### Based on our conceptual understanding of the columns in this data set.  What are the reasonable range of the values for the Sex, Age, SibSp, Parch columns.

The 'Sex" column should be limited to two values or categories - 'Male' and 'Female'.  Expect 'Age' to range from less than one year old (infants) to the very eldery (70-80).  'SibSp' and 'Parch' should have similar value ranges -- from 0, indicating a person travelling alone to up to 10 depending on family size (parents + number of siblings).

### Open the data in sublime text is there anything that jumps out to you?

Certain columns like 'age' and 'body' had numerous missing values.  Data is relatively clean relative to other data sets like Lusitania.

## Part 2: reading the data in

#### Now read the data into a Pandas DataFrame

In [1]:
import pandas as pd
import numpy as np
titanic_data_location = '/Users/nate_velarde/dsi/dsi_workspace/dsi_project_2/titanic.csv'
titanic_df = pd.read_csv(titanic_data_location)
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

#### Check that the age column doesn't have any unreasonable values

Taking a look at summary statistics for each column

In [67]:
titanic_df.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.503186,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,12.905241,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,22.000000,0.000000,0.000000,NaN,NaN
50%,3.000000,0.000000,28.000000,0.000000,0.000000,NaN,NaN
75%,3.000000,1.000000,35.000000,1.000000,0.000000,NaN,NaN
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

In addition to using df.describe() to get a sense of the overall data set, also looked at df.info() and df.types().  From the df.describe() output ('count) row, can see that the total number of passengers was 1309.  Drilling specifically into the 'age' column, see that it has a non-null 'count' of 1046 -- there are 263 passengers whose age was not known.  The range of passenger ages where data was available ranged from 0.17 years (~2 months) to 80, with a mean age of 29.9 and standard deviation of 14.4.  This age range is reasonable in the context of the lifespan of humnans.  It would make sense that a passenger liner would be carrying passengers of all ages.

In [3]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB

In [4]:
titanic_df.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

#### Check for missing values.  How do you know that a value is missing?

From the discussion above, we can determine that 263 passengers did not have values for 'age'.  We determined this by comparing the 1046 non-null entries for 'age' versus 1309 entries (rows) for the data frame -- 'pclass' had no missing values as it had 1309 non-null values according to the .info() output.  Can also confirm visually of missing values by looking for NaNs when you print out the data frame or portion of a data frame (.head()).  In addition to 'age', 'cabin', 'embarked', 'boat', 'body', 'home.dest' and 'fare' columns had missing values.

In [5]:
titanic_df['age'].unique()

array([ 29.  ,   0.92,   2.  ,  30.  ,  25.  ,  48.  ,  63.  ,  39.  ,
        53.  ,  71.  ,  47.  ,  18.  ,  24.  ,  26.  ,  80.  ,    nan,
        50.  ,  32.  ,  36.  ,  37.  ,  42.  ,  19.  ,  35.  ,  28.  ,
        45.  ,  40.  ,  58.  ,  22.  ,  41.  ,  44.  ,  59.  ,  60.  ,
        33.  ,  17.  ,  11.  ,  14.  ,  49.  ,  76.  ,  46.  ,  27.  ,
        64.  ,  55.  ,  70.  ,  38.  ,  51.  ,  31.  ,   4.  ,  54.  ,
        23.  ,  43.  ,  52.  ,  16.  ,  32.5 ,  21.  ,  15.  ,  65.  ,
        28.5 ,  45.5 ,  56.  ,  13.  ,  61.  ,  34.  ,   6.  ,  57.  ,
        62.  ,  67.  ,   1.  ,  12.  ,  20.  ,   0.83,   8.  ,   0.67,
         7.  ,   3.  ,  36.5 ,  18.5 ,   5.  ,  66.  ,   9.  ,   0.75,
        70.5 ,  22.5 ,   0.33,   0.17,  40.5 ,  10.  ,  23.5 ,  34.5 ,
        20.5 ,  30.5 ,  55.5 ,  38.5 ,  14.5 ,  24.5 ,  60.5 ,  74.  ,
         0.42,  11.5 ,  26.5 ])

#### Does it makes sense to guess at the value?

Our options in dealing with missing values are: (a) delete the row, (b) replace the NaN's with the mean, median or mode or (c) replace with 0 (for numerical data).  Of these, option (b) is the best for the 'age' column given that we do not want to lose information on other factors that may have influenced survival on 263 passengers (~20% of the overall data set).

## Part 3: data imputation

#### Well let’s say that it does... You likely noticed that Age has some missing values. How many are missing?

From our discussion above, 263.  Can also find the number of nulls directly by:

In [6]:
titanic_df['age'].isnull().sum()

263

#### For the Age of the passangers ... how would you guess at the missing values using the other data present in the CSV.

Implementing option (b) discussed above.  As a reasonableness test, going to look at differences in mean and median for the passengers (overall and by Sex) and decide which one to use to replace the NaNs.

'age' Mean

In [7]:
print "Passenger mean age: ", titanic_df['age'].mean()
print ""
print "Female mean age ", titanic_df['age'][titanic_df['sex'] == 'female'].mean()
print ""
print "Male mean age ", titanic_df['age'][titanic_df['sex'] == 'male'].mean()

Passenger mean age:  29.8811376673

Female mean age  28.6870876289

Male mean age  30.5852279635

'age' Median

In [8]:
print "Passenger median age: ", titanic_df['age'].median()
print ""
print "Female median age ", titanic_df['age'][titanic_df['sex'] == 'female'].median()
print ""
print "Male median age ", titanic_df['age'][titanic_df['sex'] == 'male'].median()

Passenger median age:  28.0

Female median age  27.0

Male median age  28.0

Given the output, using a median would be a reasonable replacement for the missing 'age' values.

In [9]:
age_null_replacement = titanic_df['age'].median()
print age_null_replacement

28.0

In [10]:
titanic_df['age'].fillna(age_null_replacement, inplace=True)
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

## Part 4: Group Statistics

#### Are there any groups that were especially adversely affected in the Titanic wreck? (justify your response numerically)

Going to examine survival rates by sex, age, passenger class, size of travelling group.

Overall survival rate for Titanic was 38% (equal to mean of Survived column in DataFrame.describe() output above).

#### Overall Pivot Table

In [11]:
titanic_df.pivot_table(index=['sex', 'pclass', 'embarked', 'sibsp', 'parch'],
                       values=['age','survived'],
                       aggfunc=[np.sum, np.mean], 
                       margins=True,
                       margins_name='All')

                                         sum                mean
                                         age survived        age  survived
sex    pclass embarked sibsp parch
female 1      C        0     0       1124.00     28.0  37.466667  0.933333
                             1        381.00     10.0  38.100000  1.000000
                             2         86.00      2.0  43.000000  1.000000
                       1     0        724.00     20.0  36.200000  1.000000
                             1        243.00      6.0  40.500000  1.000000
                             3         48.00      1.0  48.000000  1.000000
                       2     2         39.00      2.0  19.500000  1.000000
              Q        1     0         70.00      2.0  35.000000  1.000000
              S        0     0        636.00     20.0  31.800000  1.000000
                             1        233.00      7.0  33.285714  1.000000
                             2        104.00      4.0  26.000000  1.000000
                       1     0        739.00     19.0  36.950000  0.950000
                             1        301.00      6.0  50.166667  1.000000
                             2        104.00      3.0  20.800000  0.600000
                             4         60.00      1.0  60.000000  1.000000
                       2     0        167.00      3.0  55.666667  1.000000
                       3     2         75.00      3.0  25.000000  1.000000
       2      C        0     0         40.00      2.0  20.000000  1.000000
                       1     0        123.00      5.0  24.600000  1.000000
                             1         24.00      1.0  24.000000  1.000000
                             2         26.00      3.0   8.666667  1.000000
              Q        0     0         58.00      2.0  29.000000  1.000000
              S        0     0       1200.50     32.0  31.592105  0.842105
                             1        208.00      8.0  26.000000  1.000000
                             2        227.00      9.0  25.222222  1.000000
                             3         36.00      1.0  36.000000  1.000000
                       1     0        416.00      9.0  32.000000  0.692308
                             1        255.00      9.0  23.181818  0.818182
                             2        134.92      6.0  22.486667  1.000000
                             3         54.00      1.0  54.000000  1.000000
...                                      ...      ...        ...       ...
male   3      C        0     2         39.00      0.0  39.000000  0.000000
                       1     0        167.00      1.0  23.857143  0.142857
                             1        149.00      5.0  18.625000  0.625000
                       2     0         84.00      0.0  28.000000  0.000000
              Q        0     0       1330.50      6.0  29.566667  0.133333
                       1     0        140.00      0.0  28.000000  0.000000
                             1         40.00      0.0  40.000000  0.000000
                       2     0         28.00      1.0  28.000000  1.000000
                       4     1         31.00      0.0   6.200000  0.000000
              S        0     0       7875.50     40.0  28.329137  0.143885
                             1        101.83      3.0  20.366000  0.600000
                             2         62.83      1.0  15.707500  0.250000
                       1     0        599.50      3.0  27.250000  0.136364
                             1        211.25      3.0  17.604167  0.250000
                             2         83.00      1.0  20.750000  0.250000
                             3         16.00      0.0  16.000000  0.000000
                             4         40.00      0.0  40.000000  0.000000
                             5         79.00      0.0  39.500000  0.000000
                             6         40.00      0.0  40.000000  0.000000
                             9         28.00      0.0  28.000000  0.000000
                       2     0        210.00      0.0  26.250000  0.000000
                             2         18.00      0.0  18.000000  0.000000
                       3     0         31.00      0.0  31.000000  0.000000
                             1         65.00      1.0  16.250000  0.250000
                             2         14.00      0.0   7.000000  0.000000
                       4     1         40.00      0.0   8.000000  0.000000
                             2         34.00      1.0   6.800000  0.200000
                       5     2         35.00      0.0   8.750000  0.000000
                       8     2        126.50      0.0  25.300000  0.000000
All                                 38519.67    498.0  29.471821  0.381025

[130 rows x 4 columns]

###### Comparing Surivial Rates by Sex

In [12]:
titanic_df.pivot_table(index='sex', 
                       values='survived', 
                       aggfunc=[np.mean, np.std, np.count_nonzero], 
                       margins=True)

            mean       std  count_nonzero
sex
female  0.727468  0.445741          339.0
male    0.190985  0.393310          161.0
All     0.381971  0.485869          500.0

Survival rates materially different by gender.  Female survival rates more than 3x male.

###### Comparing Surivial Rates by Passenger Class

In [13]:
titanic_df.pivot_table(index='pclass', 
                       values='survived', 
                       aggfunc=[np.mean, np.std, np.count_nonzero], 
                       margins=True)

            mean       std  count_nonzero
pclass
1       0.619195  0.486338          200.0
2       0.429603  0.495915          119.0
3       0.255289  0.436331          181.0
All     0.381971  0.485869          500.0

Higher socioeconomic status improved chances of survival.  First Class (pclass=1) survival rates 44% higher than Second Class and 2.4x greater than Third Class.

###### Comparing Surivial Rates by Travelling Group Size

In [14]:
titanic_df.pivot_table(index='sibsp', 
                       values='survived', 
                       aggfunc=[np.mean, np.std, np.count_nonzero], 
                       margins=True)

           mean       std  count_nonzero
sibsp
0      0.346801  0.476219          309.0
1      0.510972  0.500665          163.0
2      0.452381  0.503761           19.0
3      0.300000  0.470162            6.0
4      0.136364  0.351250            3.0
5      0.000000  0.000000            0.0
8      0.000000  0.000000            0.0
All    0.381971  0.485869          500.0

In [15]:
titanic_df.pivot_table(index='parch', 
                       values='survived', 
                       aggfunc=[np.mean, np.std, np.count_nonzero], 
                       margins=True)

           mean       std  count_nonzero
parch
0      0.335329  0.472341          336.0
1      0.588235  0.493607          100.0
2      0.504425  0.502208           57.0
3      0.625000  0.517549            5.0
4      0.166667  0.408248            1.0
5      0.166667  0.408248            1.0
6      0.000000  0.000000            0.0
9      0.000000  0.000000            0.0
All    0.381971  0.485869          500.0

From the pivot tables above, it looks like one had a better chance of survival travelling in a group than alone.

Maybe explained by parents, specifically mothers, accompanying children onto the available lifeboats.

###### Comparing Surivial Rates by Age

First, need to group passenger ages by age brackets to make analysis easier

In [16]:
# Function to create a age bracket labels
# There is probably a more pythonic way to do this, but this works

def generate_age_label(row):
    age_bracket = row['age']
    if age_bracket < 15:
        return "0-15"
    elif age_bracket < 25:
        return "15-25"
    elif age_bracket < 35:
        return "25-35"
    elif age_bracket < 45:
        return "35-45"
    else:
        return "45-"

In [17]:
age_labels = titanic_df.apply(generate_age_label, axis=1)
titanic_df['age_b'] = age_labels
titanic_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,age_b
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",25-35
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",0-15
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",0-15
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",25-35
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",25-35

In [18]:
titanic_df.pivot_table(index='age_b', 
                       values='survived', 
                       aggfunc=[np.mean, np.std, np.count_nonzero], 
                       margins=True)

           mean       std  count_nonzero
age_b
0-15   0.559633  0.498724           61.0
15-25  0.386667  0.487800          116.0
25-35  0.329730  0.470539          183.0
35-45  0.378698  0.486504           64.0
45-    0.431818  0.496743           76.0
All    0.381971  0.485869          500.0

Other than for children (<15), not much variation in survival rates among older age brackets versus the overall Titanic survival rate of 38%.

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

There are many ways to slice and dice the data and look at many different relationships, but in the interests of time, will focus on exploring the survival rate differences betweeen males and females and between classes (socioeconomic status)

In [19]:
from scipy.stats import chi2_contingency

##### Is the Difference in Survival Rates Between Females and Males Statistically Significant?

In [20]:
sex_survival_xtab = pd.crosstab(titanic_df['survived'], titanic_df['sex'])
sex_survival_xtab

sex       female  male
survived
0            127   682
1            339   161

In [21]:
chisq_value, pvalue_sex_survived, df, expected = chi2_contingency(sex_survival_xtab)
print "Chi-square: ", chisq_value
print ""
print "p_value: ", pvalue_sex_survived
print ""
print "Degrees of Freedom: ", df
print ""
print "Expected: ", expected

Chi-square:  363.617908439

p_value:  4.58992493695e-81

Degrees of Freedom:  1

Expected:  [[ 288.00152788  520.99847212]
 [ 177.99847212  322.00152788]]

The probability associated with the Chi-square value of 364 is well under 1%.  So at the 5% significance level, we can reject the null hypothesis that survival rates for males and females are the same.  If gender did not matter, the number of female survivors would have been only 178 versus the actual of 339.

##### Are the differences in survival rates of passenger classes statistically significant?

In [22]:
class_survival_xtab = pd.crosstab(titanic_df['survived'], titanic_df['pclass'])
class_survival_xtab

pclass      1    2    3
survived
0         123  158  528
1         200  119  181

In [23]:
chisq_value, pvalue_class_survived, df, expected = chi2_contingency(class_survival_xtab)
print "Chi-square: ", chisq_value
print ""
print "p_value: ", pvalue_class_survived
print ""
print "Degrees of Freedom: ", df
print ""
print "Expected: ", expected

Chi-square:  127.859156439

p_value:  1.72082595883e-28

Degrees of Freedom:  2

Expected:  [[ 199.62337662  171.19404125  438.18258212]
 [ 123.37662338  105.80595875  270.81741788]]

The probability associated with the Chi-square value of 127 is well under 1%. So at the 5% significance level, we can reject the null hypothesis that survival rates for class are the same.  The richer you were, as measured by fare class, the more likely you were to survive.  If class did not matter, the number of survivors would have been 123 versus the actual of 200.

## Part 5:  Comparative Statistics:  Lusitania

##### Loading and reading in the Lusitania data and getting an overview of what we will be working with

In [24]:
lusitania_data_location = '/Users/nate_velarde/dsi/dsi_workspace/dsi_project_2/lusitania.csv'
lusitania_df = pd.read_csv(lusitania_data_location)
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Country,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex
0,CAMERON,Mr.,Charles W.,Lost,38,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
1,CARR-JONES,Mr.,E.,Lost,37,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
2,DRAKEFORD,Mr.,Edward,Saved,30,Band,Crew,British,Violin,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
3,HAWKINS,Mr.,Handel,Saved,25,Band,Crew,British,Cello,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
4,HEMINGWAY,Mr.,John William,Saved,27,Band,Crew,British,Double Bass,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male

In [25]:
lusitania_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1961 entries, 0 to 1960
Data columns (total 23 columns):
Family name                             1961 non-null object
Title                                   1961 non-null object
Personal name                           1958 non-null object
Fate                                    1961 non-null object
Age                                     1308 non-null object
Department/Class                        1961 non-null object
Passenger/Crew                          1961 non-null object
Citizenship                             1959 non-null object
Position                                691 non-null object
Status                                  795 non-null object
City                                    1279 non-null object
County                                  71 non-null object
State                                   1032 non-null object
Country                                 1323 non-null object
Lifeboat                                132 non-null object
Rescue Vessel                           151 non-null object
Body No.                                211 non-null object
Ticket No.                              284 non-null object
Cabin No.                               329 non-null object
Traveling Companions and other notes    598 non-null object
Value                                   1961 non-null int64
Adult/Minor                             1961 non-null object
Sex                                     1961 non-null object
dtypes: int64(1), object(22)
memory usage: 352.4+ KB

In [26]:
lusitania_df.dtypes

Family name                             object
Title                                   object
Personal name                           object
Fate                                    object
Age                                     object
Department/Class                        object
Passenger/Crew                          object
Citizenship                             object
Position                                object
Status                                  object
City                                    object
County                                  object
State                                   object
Country                                 object
Lifeboat                                object
Rescue Vessel                           object
Body No.                                object
Ticket No.                              object
Cabin No.                               object
Traveling Companions and other notes    object
Value                                    int64
Adult/Minor                             object
Sex                                     object
dtype: object

##### Taking a look at the unique values for the columns to get a better sense of the data, how to make them more comparable to Titanic and formulating a plan on how to clean them up if required.

In [27]:
lusitania_df['Fate'].unique()

array(['Lost', 'Saved', 'Saved (died from trauma)', 'Not on board'], dtype=object)

In [28]:
lusitania_df['Fate'].value_counts()

Lost                        1193
Saved                        763
Saved (died from trauma)       4
Not on board                   1
Name: Fate, dtype: int64

In [29]:
lusitania_df['Passenger/Crew'].unique()

array(['Crew', 'Passenger', 'Stowaway'], dtype=object)

In [30]:
lusitania_df['Passenger/Crew'].value_counts()

Passenger    1265
Crew          693
Stowaway        3
Name: Passenger/Crew, dtype: int64

In [31]:
lusitania_df['Department/Class'].unique()

array(['Band', 'Deck', 'Engineering', 'Saloon', 'Second', 'Stowaway',
       'Third', 'Third (Distressed British Seaman)', 'Victualling'], dtype=object)

In [32]:
lusitania_df['Department/Class'].value_counts()

Second                               601
Third                                370
Engineering                          313
Victualling                          306
Saloon                               291
Deck                                  69
Band                                   5
Third (Distressed British Seaman)      3
Stowaway                               3
Name: Department/Class, dtype: int64

In [33]:
lusitania_df['Status'].unique()

array([nan, 'Single', 'Widower', 'Married', 'Separated', '?',
       'Divorced/Engaged', 'Widowed', 'Divorced', 'Single (?)',
       'Widowed (?)', 'Divorced (?)', 'Engaged'], dtype=object)

In [34]:
lusitania_df['Status'].value_counts()

Married             423
Single              337
Widowed              17
?                     4
Divorced              3
Engaged               3
Single (?)            2
Separated             2
Widower               1
Divorced (?)          1
Divorced/Engaged      1
Widowed (?)           1
Name: Status, dtype: int64

In [35]:
print list(lusitania_df['Age'].unique())

['38', '37', '30', '25', '27', '48', nan, '24', '19 ?', '57', '50', '56', '41', '19', '33', '29', '18', '20', '21', '26', '17', '58', '47', '54', '35', '43', '59', '53', '44', '51', '40', '49', '42', '32', '31', '34', '22', '45', '36', '29 ?', '52', '23', '60', '28', '16', '46', '15', '39', '63 ?', '55', '64', '53 ?', '09-months', '6', '9', '14', '10', '12', '?', '62', '5', '8', '65', '68', '76', '61', '63', '03-months', '1.5', '2.5', '18-months', '3', '2', '25 ?', '08-months', '4', '15-months', '14-months', 'Infant', '3-6-months ?', '51 or 47', '45 or 51', '22 (?)', '17-months', '13-months', '02-months', '49 ?', '05-months', '11', '59 (64?)', '63 (51?)', '37 (39?)', '32 (22?)', '31 (32?)', '24 (23?)', '27?', '7', '42?', '31 ?', '10-months', '38 (?)', '70', '62 (?)', '06-months', '13', '2_', '11-months', '30 ?', '34?', '1', '39 (47?)', '67', '73', '72', '11-months (3?)', '4.25', '69', '26?', '54?', '21?', '16 ?']

##### First task is to clean the 'Age' column and eventually convert from strings to floats

In [36]:
import re

In [37]:
# Per Josh's best cleaning practive - set up a temp version of 'Age'
lusitania_df['Age_tmp'] = lusitania_df['Age']

In [38]:
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex,Age_tmp
0,CAMERON,Mr.,Charles W.,Lost,38,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,38
1,CARR-JONES,Mr.,E.,Lost,37,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,37
2,DRAKEFORD,Mr.,Edward,Saved,30,Band,Crew,British,Violin,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,30
3,HAWKINS,Mr.,Handel,Saved,25,Band,Crew,British,Cello,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,25
4,HEMINGWAY,Mr.,John William,Saved,27,Band,Crew,British,Double Bass,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,27

In [39]:
lusitania_df['Age_tmp'].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19 ?', '57', '50',
       '56', '41', '19', '33', '29', '18', '20', '21', '26', '17', '58',
       '47', '54', '35', '43', '59', '53', '44', '51', '40', '49', '42',
       '32', '31', '34', '22', '45', '36', '29 ?', '52', '23', '60', '28',
       '16', '46', '15', '39', '63 ?', '55', '64', '53 ?', '09-months',
       '6', '9', '14', '10', '12', '?', '62', '5', '8', '65', '68', '76',
       '61', '63', '03-months', '1.5', '2.5', '18-months', '3', '2',
       '25 ?', '08-months', '4', '15-months', '14-months', 'Infant',
       '3-6-months ?', '51 or 47', '45 or 51', '22 (?)', '17-months',
       '13-months', '02-months', '49 ?', '05-months', '11', '59 (64?)',
       '63 (51?)', '37 (39?)', '32 (22?)', '31 (32?)', '24 (23?)', '27?',
       '7', '42?', '31 ?', '10-months', '38 (?)', '70', '62 (?)',
       '06-months', '13', '2_', '11-months', '30 ?', '34?', '1',
       '39 (47?)', '67', '73', '72', '11-months (3?)', '4.25', '69', '26?',
       '54?', '21?', '16 ?'], dtype=object)

In [40]:
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace(' \?','.0')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('(\d)\?','\\1')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('(...\d\d)','\\1')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('\?','30')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('2_','20')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('..-months','1')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('Infant','1')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('45 or 51','47')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('51 or 47','49')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('(\d\d)..(\d\d).','\\1')
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].str.replace('(\d)..(\d).','\\1')

In [41]:
lusitania_df['Age_tmp'].unique()

array(['38', '37', '30', '25', '27', '48', nan, '24', '19.0', '57', '50',
       '56', '41', '19', '33', '29', '18', '20', '21', '26', '17', '58',
       '47', '54', '35', '43', '59', '53', '44', '51', '40', '49', '42',
       '32', '31', '34', '22', '45', '36', '29.0', '52', '23', '60', '28',
       '16', '46', '15', '39', '63.0', '55', '64', '53.0', '1', '6', '9',
       '14', '10', '12', '62', '5', '8', '65', '68', '76', '61', '63',
       '1.5', '2.5', '3', '2', '25.0', '4', '31.0', '49.0', '11', '7',
       '70', '13', '30.0', '67', '73', '72', '4.25', '69', '16.0'], dtype=object)

In [42]:
# Converting strings to floats
lusitania_df['Age_tmp'] = lusitania_df['Age_tmp'].astype(float)

In [43]:
lusitania_df['Age_tmp'].unique()

array([ 38.  ,  37.  ,  30.  ,  25.  ,  27.  ,  48.  ,    nan,  24.  ,
        19.  ,  57.  ,  50.  ,  56.  ,  41.  ,  33.  ,  29.  ,  18.  ,
        20.  ,  21.  ,  26.  ,  17.  ,  58.  ,  47.  ,  54.  ,  35.  ,
        43.  ,  59.  ,  53.  ,  44.  ,  51.  ,  40.  ,  49.  ,  42.  ,
        32.  ,  31.  ,  34.  ,  22.  ,  45.  ,  36.  ,  52.  ,  23.  ,
        60.  ,  28.  ,  16.  ,  46.  ,  15.  ,  39.  ,  63.  ,  55.  ,
        64.  ,   1.  ,   6.  ,   9.  ,  14.  ,  10.  ,  12.  ,  62.  ,
         5.  ,   8.  ,  65.  ,  68.  ,  76.  ,  61.  ,   1.5 ,   2.5 ,
         3.  ,   2.  ,   4.  ,  11.  ,   7.  ,  70.  ,  13.  ,  67.  ,
        73.  ,  72.  ,   4.25,  69.  ])

Similar to what we did in Titanic, have to decide what to with the NaNs.  First examine the differences in mean, median and mode and see if gender skewed the results.

'Age' Mean

In [44]:
print "Passenger mean age: ", lusitania_df['Age_tmp'].mean()
print ""
print "Female mean age ", lusitania_df['Age_tmp'][lusitania_df['Sex'] == 'Female'].mean()
print ""
print "Male mean age ", lusitania_df['Age_tmp'][lusitania_df['Sex'] == 'Male'].mean()

Passenger mean age:  32.3220565749

Female mean age  31.2670454545

Male mean age  32.8568548387

'Age' Median

In [45]:
print "Passenger median age: ", lusitania_df['Age_tmp'].median()
print ""
print "Female median age ", lusitania_df['Age_tmp'][lusitania_df['Sex'] == 'Female'].median()
print ""
print "Male median age ", lusitania_df['Age_tmp'][lusitania_df['Sex'] == 'Male'].median()

Passenger median age:  32.0

Female median age  31.0

Male median age  32.0

Given the output, using a median would be a reasonable replacement for the missing 'age' values.

In [46]:
l_age_null_replacement = lusitania_df['Age_tmp'].median()
l_age_null_replacement

32.0

In [47]:
lusitania_df['Age_tmp'].fillna(l_age_null_replacement, inplace=True)
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex,Age_tmp
0,CAMERON,Mr.,Charles W.,Lost,38,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,38.0
1,CARR-JONES,Mr.,E.,Lost,37,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,37.0
2,DRAKEFORD,Mr.,Edward,Saved,30,Band,Crew,British,Violin,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,30.0
3,HAWKINS,Mr.,Handel,Saved,25,Band,Crew,British,Cello,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,25.0
4,HEMINGWAY,Mr.,John William,Saved,27,Band,Crew,British,Double Bass,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male,27.0

In [48]:
# Now that 'Age_tmp' is cleaned up, set equal to 'Age' and drop the tmp column
lusitania_df['Age'] = lusitania_df['Age_tmp']
lusitania_df.drop('Age_tmp', inplace=True, axis=1)
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Country,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex
0,CAMERON,Mr.,Charles W.,Lost,38.0,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
1,CARR-JONES,Mr.,E.,Lost,37.0,Band,Crew,British,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
2,DRAKEFORD,Mr.,Edward,Saved,30.0,Band,Crew,British,Violin,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
3,HAWKINS,Mr.,Handel,Saved,25.0,Band,Crew,British,Cello,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male
4,HEMINGWAY,Mr.,John William,Saved,27.0,Band,Crew,British,Double Bass,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,1,Adult,Male

##### Making the Lusitania data comparable to Titanic to eventually get apples to apples comparisons between the two disasters

Lusitania data contains information on crew members, whereas the Titanic data set excluded
the crew.  As the crew (the ones not manning the lifeboats) were expected to ensure passenger
survival above their own, it would expected a priori that survival rates for crew to be
significantly lower than for passengers.

Dropping the crew - left with Passengers and Stowaways

Made the decision to drop Stowaways as well due to there was not any other data besides that they were male (German spies) and they survived.  There were only 3 stowaways relative to 1265 passengers.  Making the judgement call tha ignoring them should not impact our results.

In [49]:
stowaways = lusitania_df.loc[lusitania_df['Passenger/Crew'] == 'Stowaway']
stowaways.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Country,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex
1279,UNKNOWN,Mr.,NaN,Lost,32.0,Stowaway,Stowaway,German,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,"German spy arrested by Inspector Pierpont, los...",1,Adult,Male
1280,UNKNOWN,Mr.,NaN,Lost,32.0,Stowaway,Stowaway,German,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,"German spy arrested by Inspector Pierpont, los...",1,Adult,Male
1281,UNKNOWN,Mr.,NaN,Lost,32.0,Stowaway,Stowaway,German,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,"German spy arrested by Inspector Pierpont, los...",1,Adult,Male

In [50]:
lusitania_df = lusitania_df.loc[lusitania_df['Passenger/Crew'] == 'Passenger']
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Country,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex
387,ADAMS,Mr.,William McMillan,Saved,19.0,Saloon,Passenger,USA,NaN,Single,...,England,17,NaN,NaN,46102,D 45,Arthur Adams (father),1,Adult,Male
388,ADAMS,Mr.,Arthur Henry,Lost,46.0,Saloon,Passenger,USA,NaN,Married,...,England,17,NaN,NaN,46102,D 37,William Adams (son),1,Adult,Male
389,ADAMS,Mr.,Henry,Lost,58.0,Saloon,Passenger,British,NaN,Married,...,England,NaN,NaN,237,1298,B 27,Annie Adams (wife),1,Adult,Male
390,ADAMS,Mrs.,Henry (Annie Elizabeth Macnutt),Saved,46.0,Saloon,Passenger,British,NaN,Married,...,Canada and USA,NaN,NaN,NaN,1298,B 27,Henry Adams (husband),1,Adult,Female
391,ALLAN,Lady,Hugh Montagu (Marguerite Ethel MacKenzie),Saved,42.0,Saloon,Passenger,British,NaN,Married,...,Canada,collapsible (22?),Westborough (Katrina),NaN,12933,"B 47, B 49 (regal suite and bath)","Anna Allan (daughter), Gwendolyn Allan (daught...",1,Adult,Female

In [51]:
lusitania_df['Passenger/Crew'].unique()

array(['Passenger'], dtype=object)

In [52]:
lusitania_df['Department/Class'].unique()

array(['Saloon', 'Second', 'Third', 'Third (Distressed British Seaman)'], dtype=object)

##### This section takes values from 'Fate' to make a column comparable to the 'Survived' column in Titanic

Simplify classifications to Survived = 1 to Died = 0

In [53]:
lusitania_df['Fate'].unique()

array(['Saved', 'Lost', 'Saved (died from trauma)', 'Not on board'], dtype=object)

In [54]:
lusitania_df['Survived'] = lusitania_df['Fate'].apply(lambda x: 1 if x == 'Saved' else 0)
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Lifeboat,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex,Survived
387,ADAMS,Mr.,William McMillan,Saved,19.0,Saloon,Passenger,USA,NaN,Single,...,17,NaN,NaN,46102,D 45,Arthur Adams (father),1,Adult,Male,1
388,ADAMS,Mr.,Arthur Henry,Lost,46.0,Saloon,Passenger,USA,NaN,Married,...,17,NaN,NaN,46102,D 37,William Adams (son),1,Adult,Male,0
389,ADAMS,Mr.,Henry,Lost,58.0,Saloon,Passenger,British,NaN,Married,...,NaN,NaN,237,1298,B 27,Annie Adams (wife),1,Adult,Male,0
390,ADAMS,Mrs.,Henry (Annie Elizabeth Macnutt),Saved,46.0,Saloon,Passenger,British,NaN,Married,...,NaN,NaN,NaN,1298,B 27,Henry Adams (husband),1,Adult,Female,1
391,ALLAN,Lady,Hugh Montagu (Marguerite Ethel MacKenzie),Saved,42.0,Saloon,Passenger,British,NaN,Married,...,collapsible (22?),Westborough (Katrina),NaN,12933,"B 47, B 49 (regal suite and bath)","Anna Allan (daughter), Gwendolyn Allan (daught...",1,Adult,Female,1

In [55]:
lusitania_df['Survived'].unique()

array([1, 0])

##### Creating a Column comparable to pclass in Titanic based on Department/Class

In [56]:
lusitania_df['Department/Class'].unique()

array(['Saloon', 'Second', 'Third', 'Third (Distressed British Seaman)'], dtype=object)

In [57]:
lusitania_df.loc[(lusitania_df['Department/Class'] == 'Saloon'), 'pclass'] = 1
lusitania_df.loc[(lusitania_df['Department/Class'] == 'Second'), 'pclass'] = 2
lusitania_df.loc[(lusitania_df['Department/Class'] == 'Third'), 'pclass'] = 3
lusitania_df.loc[(lusitania_df['Department/Class'] == 'Third (Distressed British Seaman)'), 'pclass'] = 3
lusitania_df.head()

,Family name,Title,Personal name,Fate,Age,Department/Class,Passenger/Crew,Citizenship,Position,Status,...,Rescue Vessel,Body No.,Ticket No.,Cabin No.,Traveling Companions and other notes,Value,Adult/Minor,Sex,Survived,pclass
387,ADAMS,Mr.,William McMillan,Saved,19.0,Saloon,Passenger,USA,NaN,Single,...,NaN,NaN,46102,D 45,Arthur Adams (father),1,Adult,Male,1,1.0
388,ADAMS,Mr.,Arthur Henry,Lost,46.0,Saloon,Passenger,USA,NaN,Married,...,NaN,NaN,46102,D 37,William Adams (son),1,Adult,Male,0,1.0
389,ADAMS,Mr.,Henry,Lost,58.0,Saloon,Passenger,British,NaN,Married,...,NaN,237,1298,B 27,Annie Adams (wife),1,Adult,Male,0,1.0
390,ADAMS,Mrs.,Henry (Annie Elizabeth Macnutt),Saved,46.0,Saloon,Passenger,British,NaN,Married,...,NaN,NaN,1298,B 27,Henry Adams (husband),1,Adult,Female,1,1.0
391,ALLAN,Lady,Hugh Montagu (Marguerite Ethel MacKenzie),Saved,42.0,Saloon,Passenger,British,NaN,Married,...,Westborough (Katrina),NaN,12933,"B 47, B 49 (regal suite and bath)","Anna Allan (daughter), Gwendolyn Allan (daught...",1,Adult,Female,1,1.0

In [58]:
lusitania_df['pclass'].unique()

array([ 1.,  2.,  3.])

## Lusitania Group Statistics

Now that we have cleaned the data and gotten in a form comparable to Titanic, we can compute some group statistics.

In [59]:
lusitania_df.describe()

               Age        Value     Survived       pclass
count  1265.000000  1265.000000  1265.000000  1265.000000
mean     31.981225     0.999209     0.373913     2.064822
std      13.821666     0.028116     0.484032     0.721880
min       1.000000     0.000000     0.000000     1.000000
25%      26.000000     1.000000     0.000000     2.000000
50%      32.000000     1.000000     0.000000     2.000000
75%      39.000000     1.000000     1.000000     3.000000
max      76.000000     1.000000     1.000000     3.000000

#### Are there any groups that were especially adversely affected in the Lusitania wreck? (justify your response numerically)

Similar to Titanic, we are going to examine survival rates by sex and passenger class.  I would have liked to have also looked at survival rates by age and by size of travelling group, but ran out of time.

Overall survival rate for Lusitania passengers was 37% versus 38% for Titanic (equal to mean of Survived column in DataFrame.describe() output above).

##### Overall Pivot Table for the Cleaned Lusitania Data Set

In [60]:
lusitania_df.pivot_table(index=['Sex', 'pclass'],
                       values=['Age','Survived'],
                       aggfunc=[np.sum, np.mean], 
                       margins=True,
                       margins_name='All')

                    sum                mean
                    Age Survived        Age  Survived
Sex    pclass
Female 1.0      3343.00     34.0  36.736264  0.373626
       2.0      8855.00    108.0  30.119048  0.367347
       3.0      3139.50     40.0  29.069444  0.370370
Male   1.0      7944.00     78.0  39.720000  0.390000
       2.0      9163.50    119.0  29.848534  0.387622
       3.0      8011.25     94.0  30.231132  0.354717
All            40456.25    473.0  31.981225  0.373913

##### Comparing Survival Rates by Sex

In [61]:
lusitania_df.pivot_table(index='Sex', 
                         values='Survived', 
                         aggfunc=[np.mean, np.std, np.count_nonzero], 
                         margins=True)

            mean       std  count_nonzero
Sex
Female  0.369168  0.483070          182.0
Male    0.376943  0.484935          291.0
All     0.373913  0.483841          473.0

Unlike the Titanic, there is was no significant difference in survival rates between men and women on the Lusitania.  This may be explained by the differences in how the ships sank.  The Lusitania was topedoed by a German U-Boat, which meant that it sunk very quickly relative to Titanic, which had time to organize getting women and children to lifeboats.

##### Are the survival rates between men and women statistically signifcant?

In [62]:
l_sex_survival_xtab = pd.crosstab(lusitania_df['Survived'], lusitania_df['Sex'])
l_sex_survival_xtab

Sex       Female  Male
Survived
0            311   481
1            182   291

In [63]:
chisq_value, pvalue_l_sex_survived, df, expected = chi2_contingency(l_sex_survival_xtab)
print "Chi-square: ", chisq_value
print ""
print "p_value: ", pvalue_l_sex_survived
print ""
print "Degrees of Freedom: ", df
print ""
print "Expected: ", expected

Chi-square:  0.0480226472977

p_value:  0.826540445581

Degrees of Freedom:  1

Expected:  [[ 308.66086957  483.33913043]
 [ 184.33913043  288.66086957]]

The probability associated with the Chi-square value of 0.05 is ~83%. So at the 5% significance level, we fail to reject the null hypothesis that survival rates for males and females are the same. This statistically backs up our intuition above when looking at male/female survival rates.  Unlike on the Titanic, there was no advantage in being a women in surviving a ship that sank much faster.

##### Comparing Survival Rates by Passenger Class (Socioeconomic Status)

In [64]:
lusitania_df.pivot_table(index='pclass', 
                         values='Survived', 
                         aggfunc=[np.mean, np.std, np.count_nonzero], 
                         margins=True)

            mean       std  count_nonzero
pclass
1.0     0.384880  0.487405          112.0
2.0     0.377704  0.485217          227.0
3.0     0.359249  0.480425          134.0
All     0.373913  0.483841          473.0

Similar to male/female survival rate analysis above and in contrast to the the Titanic, there is was no significant difference in survival rates between socioeconomic classes.  Again, this may be explained by the circumstances in how the ships sank.

##### Are the Survival Rates between Passenger Class Statistically Significant?

In [65]:
l_pclass_survival_xtab = pd.crosstab(lusitania_df['Survived'], lusitania_df['pclass'])
l_pclass_survival_xtab

pclass    1.0  2.0  3.0
Survived
0         179  374  239
1         112  227  134

In [66]:
chisq_value, pvalue_l_pclass_survived, df, expected = chi2_contingency(l_pclass_survival_xtab)
print "Chi-square: ", chisq_value
print ""
print "p_value: ", pvalue_l_pclass_survived
print ""
print "Degrees of Freedom: ", df
print ""
print "Expected: ", expected

Chi-square:  0.528993809855

p_value:  0.767592024617

Degrees of Freedom:  2

Expected:  [[ 182.19130435  376.27826087  233.53043478]
 [ 108.80869565  224.72173913  139.46956522]]

The probability associated with the Chi-square value of 0.53 is ~77%. So at the 5% significance level, we fail to reject the null hypothesis that survival rates between passenger classes are the same. This statistically backs up our intuition discussed above.

#### Are there any groups that outperformed the survival of the latter group? (justify your response numerically)

See above for numerical response.  Unlike on the Titanic, being a woman and/or having greater socioeconomic status did not improve one's survival rate on the Lusitania.

#### What does the group-wise survival rate imply about circumstances during these two accidents?

As touched on above, the differences in how fast the Lusitania and Titanic sank explains differences in group-wise survival rates between the two accidents.  Lusitania sank in 18 minutes versus 2 hours and 40 minutes for Titanic.  The Luisitania had no time to prioritize getting women and children to safety, whereas Titanic was able to get a signifant proportion of these groups off in lifeboats.

The quick sinking of the Lusitania also explains why there was no difference in survival rates amongst passenger classes (our proxy for socioeconomic status).  It was an every man for himself situation on the Lusitania, whereas on the Titanic, men with wealth had time to use it (presumeably by bribing their way onto a lifeboat or locking steerage passengers below deck to improve their chances at the lifeboats as depicted in the movie.

I did not have time to dig into it, but if you looked deeper into survival rates by age on the Lusitania, I suspect that there would not be much variation in survival rates between age groups given how quickly the ship sank.  At least on the Titanic, there was a meaningful difference in survival rates between children and adults (I suspect this was difference is statistically different, but had no time to modify the Titanic data frame to create an 'Child/Adult' column where Child represents passengers less than 15 years old and run a Chi-squared test to confirm).

What is interesting is that despite the differences in sinking time, the overall survival rate for both disasters was nearly the same (37-38%).  That either speaks to the heroism of the Lusitania crew and/or ineptness of the Titanic's.  One other explanation could be the location of the accidents.  The Lusitania sank off the coast of Ireland versus the North Atlantic for Titanic.  Perhaps the Lusitania passengers who fell into the water had a higher chance of survival given the differences in water temperature.